#include "logo.h"
#include "logo.h"
#include "../drivers/video.h"
#include "../utils/utils.h"

void print_logo() {
    clear_screen();

    kprint("  лллЛ   лллЛ лллллЛ ллллллЛ лллллллЛ лллллЛ      ллллллЛ лллллллЛ  ", 7, 5, 0x0B);
    kprint("  ллллЛ ллллКллЩЭЭллЛллЩЭЭллЛллЩЭЭЭЭМллЩЭЭллЛ    ллЩЭЭЭллЛллЩЭЭЭЭМ  ", 8, 5, 0x0B);
    kprint("  ллЩллллЩллКлллллллКллллллЩМлллллЛ  лллллллК    ллК   ллКлллллллЛ  ", 9, 5, 0x0B);
    kprint("  ллКШллЩМллКллЩЭЭллКллЩЭЭллЛллЩЭЭМ  ллЩЭЭллК    ллК   ллКШЭЭЭЭллК  ", 10, 5, 0x0B);
    kprint("  ллК ШЭМ ллКллК  ллКллК  ллКллК     ллК  ллК    ШллллллЩМлллллллК  ", 11, 5, 0x0B);
    kprint("  ШЭМ     ШЭМШЭМ  ШЭМШЭМ  ШЭМШЭМ     ШЭМ  ШЭМ     ШЭЭЭЭЭМ ШЭЭЭЭЭЭМ  ", 12, 5, 0x0B);
    kprint("                         v1.0  by d0ct0rvrach                         ", 14, 5, 0x08);

    for (int i = 0; i < 10; i++) {
    put_char('@', 24 * 80 + 39, 0x0B);
    sleep(250);
    put_char(' ', 24 * 80 + 39, 0x00);
    sleep(250);
    }
    clear_screen();
}
